if __name__ == '__main__':
    # 空气质量为优的天数
    lst_weather=[["周一", "16", "26","多云","1级","优"],["周二", "17", "27","晴","2级","优"],["周三", "16", "28","晴","3级","优"],["周四", "16", "25","阴","2级","良"],["周五", "15", "24","阴","2级","良"],["周六", "15", "25","晴","3级","优"],["周日", "14", "23","小雨","3级","良"]]
    a=[x for x in lst_weather if x[5]=="优"] #获取是优的所有元素
    c=len(a)
    d=[y[0] for y in a] #获取周数
    e=','.join(d)
    print("空气质量为优的天数:{},它们分别是：{}".format(c,e))

    # 风力低于3级且最高气温不超过25度的天数
    n=[i for i in lst_weather if (i[4]!='3级' and i[2]<='25')]
    m=len(n)
    g=[k[0] for k in n]
    p=','.join(g)
    print("风力低于3级且最高气温不超过25度的天数：{},它们分别是:{}".format(m,p))

    # 平均气温低于20摄氏度的天数
    t = [e for e in lst_weather if ((eval(e[1])+eval(e[2]))/2)<20]
    h=len(t)
    r=[v[0] for v in t]
    l=','.join(r)
    print("平均气温低于20摄氏度的天数:{},它们分别是：{}".format(h,l))
