if __name__ == '__main__':
    dic_house={'001':{'房型':'3室1厅','面积/平方米':68.69,'朝向':'南北','装修情况':'简装','挂牌价/(元/平方米)':37124,'关注人数':35},'002':{'房型':'2室2厅','面积/平方米':87.16,'朝向':'南西','装修情况':'精装','挂牌价/(元/平方米)':37375,'关注人数':148},'003':{'房型':'3室1厅','面积/平方米':61.72,'朝向':'南北','装修情况':'精装','挂牌价/(元/平方米)':37266,'关注人数':146},'004':{'房型':'3室2厅','面积/平方米':68.18,'朝向':'南北','装修情况':'精装','挂牌价/(元/平方米)':68496,'关注人数':79},'005':{'房型':'2室2厅','面积/平方米':71.67,'朝向':'南','装修情况':'简装','挂牌价/(元/平方米)':33487,'关注人数':105},'006':{'房型':'3室1厅','面积/平方米':84.78,'朝向':'南北','装修情况':'简装','挂牌价/(元/平方米)':51782,'关注人数':34}}
    d1=[] #存放编号
    d2=[] #存放挂牌价
    d3=[] #存放关注人数
    for x,y in dic_house.items():
        d1=d1+[x]
        for n,m in y.items():
            if n=='挂牌价/(元/平方米)':
                d2=d2+[m]
            if n=='关注人数':
                d3=d3+[m]
    dic_house1=dict(zip(d2,d1))
    dic_house2 = dict(zip(d3, d1))
    l1=sorted(dic_house1)
    l2=sorted(dic_house2)
    print("挂牌价最低的三套房源的信息依次是:{},{},{}".format(dic_house[dic_house1[l1[0]]],dic_house[dic_house1[l1[1]]],dic_house[dic_house1[l1[2]]]))
    print("关注人气最高的三套房源的信息依次是:{},{},{}".format(dic_house[dic_house2[l2[-1]]], dic_house[dic_house2[l2[-2]]],dic_house[dic_house2[l2[-3]]]))
